showAboutBox.Action.text = \u0417\u0430...
showAboutBox.Action.shortDescription = \u041F\u043E\u043A\u0430\u0436\u0438 SortTest \u043D\u0430 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F \u0434\u0438\u0430\u043B\u043E\u0433\u043E\u0432\u0438\u044F

# status bar resources
jlElapseTimeLabel.text=\u0418\u0437\u0442\u0435\u0447\u0435 \u0432\u0440\u0435\u043C\u0435\u0442\u043E:
jlElapseTimeValue.text=0
jlStatusLabel.text=\u0421\u0442\u0430\u0442\u0443\u0441:
jlStatusValue.text=\u041D\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D
jlSizeLabel.text=\u0411\u0440\u043E\u044F\u0442 \u043D\u0430 \u0446\u0435\u043B\u0438\u0442\u0435 \u0447\u0438\u0441\u043B\u0430:
jtfSizeValue.text=\u041A\u043E\u043B\u043A\u043E \u0434\u0430 \u043F\u043E\u0434\u0440\u0435\u0434\u0438?
#NOI18N
jtfSizeValue.font=Tahoma-Italic-11
jlAlgorithmSelectionLabel.text=\u0410\u043B\u0433\u043E\u0440\u0438\u0442\u044A\u043C \u0437\u0430 \u043F\u043E\u0434\u0431\u043E\u0440
jcbAlgorithmSelection.toolTipText=\u0418\u0437\u0431\u0435\u0440\u0435\u0442\u0435 \u0432\u043D\u0438\u043C\u0430\u0442\u0435\u043B\u043D\u043E. \u041D\u044F\u043A\u043E\u0438 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0438 \u043D\u0435 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0437\u0430\u0432\u044A\u0440\u0448\u0438 \u0432 \u0436\u0438\u0432\u043E\u0442\u0430 \u0432\u0438.
jtfSizeValue.toolTipText=\u0420\u0430\u0437\u043C\u0435\u0440\u044A\u0442 \u0438\u043C\u0430 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435, \u043E\u0441\u043E\u0431\u0435\u043D\u043E \u0441 N-\u043A\u0432\u0430\u0434\u0440\u0430\u0442 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0438.
jbBeginSort.text=\u0417\u0430\u043F\u043E\u0447\u043D\u0435\u0442\u0435 \u0441\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435
#NOI18N
jlAlgorithmSelectionLabel.font=Tahoma-Plain-11
jbBeginSort.toolTipText=\u0418\u0437\u0442\u0435\u0447\u0435 \u0432\u0440\u0435\u043C\u0435\u0442\u043E \u0438 \u0438\u0437\u0432\u0430\u0434\u043A\u0430\u0442\u0430 \u0440\u0435\u0437\u0443\u043B\u0442\u0430\u0442\u0438\u0442\u0435 \u0449\u0435 \u0441\u0435 \u043F\u043E\u043A\u0430\u0437\u0432\u0430\u0442 \u0441\u043B\u0435\u0434 \u043F\u0440\u0438\u043A\u043B\u044E\u0447\u0432\u0430\u043D\u0435.
jtpSortResults.contentType=text/html
#NOI18N
jtpSortResults.font=Calibri-Plain-10
jcbFixedRandomizingSeed.text=\u0424\u0438\u043A\u0441\u0438\u0440\u0430\u043D\u0430 \u0441\u0435\u043C\u0435\u043D\u0430
jcbFixedRandomizingSeed.toolTipText=\u0412\u043A\u043B\u044E\u0447\u0435\u0442\u0435 \u0434\u0430 \u0437\u0430\u043F\u0430\u0437\u044F\u0442 \u043C\u043D\u043E\u0433\u043E\u043A\u0440\u0430\u0442\u043D\u043E \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u043D\u043E\u0441\u0442. \u0418\u0437\u043A\u043B\u044E\u0447\u0435\u0442\u0435 \u0437\u0430 \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u0430\u043D\u0435 \u043D\u0430 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u0438 \u0441\u0435\u043C\u0435\u043D\u0430.
jbKillSort.text=\u0423\u0431\u0438\u0439 \u0441\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435
jbKillSort.toolTipText=\u0410\u043A\u043E \u0441\u0438 \u043F\u043E\u0434\u0440\u0435\u0434\u0438\u043C \u043C\u043E\u0436\u0435 \u0434\u0430 \u0441\u0435 \u043A\u0430\u043D\u0434\u0438\u0434\u0430\u0442\u0438\u0440\u0430 \u0437\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0445\u0438\u043B\u044F\u0434\u0438 \u0433\u043E\u0434\u0438\u043D\u0438, \u043C\u043E\u0436\u0435 \u0434\u0430 \u0433\u043E \u0443\u0431\u0438\u0435.
jtpSortResults.text=<html>\r\n  <head>\r\n\r\n  </head>\r\n  <body>\r\n    <p style="margin-top: 0">\r\n      \r\n    </p>\r\n  </body>\r\n</html>\r\n
jpSortInProgress.imageIcon=boingdragon.gif
jbKillDragon.toolTipText=\u0410\u043A\u043E \u0441\u0438 \u043F\u043E\u0434\u0440\u0435\u0434\u0438\u043C \u043C\u043E\u0436\u0435 \u0434\u0430 \u0441\u0435 \u043A\u0430\u043D\u0434\u0438\u0434\u0430\u0442\u0438\u0440\u0430 \u0437\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0445\u0438\u043B\u044F\u0434\u0438 \u0433\u043E\u0434\u0438\u043D\u0438, \u043C\u043E\u0436\u0435 \u0434\u0430 \u0443\u0431\u0438\u0435 \u0434\u0440\u0430\u043A\u043E\u043D\u0430.
jbKillDragon.text=
#NOI18N
jbKillDragon.icon=Fire-in-Dragon.gif
jtpTitleExplanation.contentType=text/html
jtpTitleExplanation.text=<html>\r\n  <body>\r\n    <font face="arial,sans-serif"><font size="5">\n    <b>\u0418\u0437\u0432\u044A\u0440\u0448\u0432\u0430\u0449\u0430 \u0435\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u043E\u0441\u0442\u0442\u0430 \u0441\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u044A\u043C</b>\n    <font size="3"><br><br>\r\u0421\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435\u0442\u043E \u043C\u043E\u0436\u0435 \u0434\u0430 \u0441\u0435 \u0438\u0437\u0432\u044A\u0440\u0448\u0438 \u043A\u0430\u0442\u043E \u0441\u0435 \u0438\u0437\u043F\u043E\u043B\u0437\u0432\u0430 \u0435\u0434\u0438\u043D \u043E\u0442 \u043C\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u0438 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0438. \u041C\u043E\u0436\u0435\u0442\u0435 \u0434\u0430 \u0438\u0437\u043F\u043E\u043B\u0437\u0432\u0430\u0442\u0435 \u0442\u043E\u0432\u0430 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0437\u0430 \u043E\u0446\u0435\u043D\u043A\u0430 \u043D\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u043D\u0430\u0442\u0430 \u0435\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u043E\u0441\u0442 \u043D\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u0438 \u0430\u043B\u0433\u043E\u0440\u0438\u0442\u043C\u0438.\n    <br><br>\u0410\u043A\u043E \u0440\u0435\u0448\u0438\u0442\u0435 <i> \u043B\u043E\u0448\u043E </i> - \u0430\u043A\u043E \u0432\u0438\u0434\u0438\u0448 \u043C\u043E\u0436\u0435 \u0434\u0430 \u043F\u0440\u043E\u0434\u044A\u043B\u0436\u0438 \u0437\u0430 1000 \u0433\u043E\u0434\u0438\u043D\u0430, \u0432\u0438\u043D\u0430\u0433\u0438 \u043C\u043E\u0436\u0435 \u0434\u0430 <i> \u0443\u0431\u0438\u0435 \u0434\u0440\u0430\u043A\u043E\u043D\u0430 </i>, \u0437\u0430 \u0434\u0430 \u043F\u0440\u0435\u043A\u0440\u0430\u0442\u0438 \u0432\u0438\u0434.\n  </body>\r\n</html>\r\n
jbAboutDialog.toolTipText=\u0412\u043C\u044A\u043A\u0432\u0430\u043D\u0435 \u043D\u0430 \u0434\u0438\u0430\u043B\u043E\u0433\u0430.
jbAboutDialog.text=\u0421\u044A\u0437\u0434\u0430\u0434\u0435\u043D\u043E \u043E\u0442 Rex Woollard
jbExit.text=\u0418\u0437\u0445\u043E\u0434
jbExit.toolTipText=\u0418\u0437\u043B\u0435\u0437\u0442\u0435 \u043E\u0442 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435\u0442\u043E.
jbGarbageCollection.text=\u0421\u044A\u0431\u0438\u0440\u0430\u043D\u0435 \u043D\u0430 \u0431\u043E\u043A\u043B\u0443\u043A\u0430
jbGarbageCollection.toolTipText=\u0423\u0447\u0442\u0438\u0432\u043E \u0434\u0430 \u043F\u043E\u0438\u0441\u043A\u0430 \u043E\u0442 Java VM \u0434\u0430 \u0441\u0435 \u043E\u0441\u0432\u043E\u0431\u043E\u0434\u0438 \u043F\u0430\u043C\u0435\u0442. \u041C\u043E\u0436\u0435 \u0431\u0438 \u0442\u043E\u0432\u0430 \u0449\u0435 \u0441\u0442\u0430\u043D\u0435.

HOW_MANY=\u041A\u043E\u043B\u043A\u043E?
SORT_TERMINATED_BEFORE_COMPLETION=\u0421\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435 \u043F\u0440\u0435\u043A\u0440\u0430\u0442\u0435\u043D \u043F\u0440\u0435\u0434\u0438 \u043F\u0440\u0438\u043A\u043B\u044E\u0447\u0432\u0430\u043D\u0435!
INVALID_SIZE=<font face=\"arial,sans-serif\" size=\"2\"><b>\u041D\u0435\u0432\u0430\u043B\u0438\u0434\u0435\u043D \u0440\u0430\u0437\u043C\u0435\u0440.</b>
BUILDING_RANDOM_NUMBERS=<font face=\"arial,sans-serif\" size=\"2\"><b>\u0418\u0437\u0433\u0440\u0430\u0436\u0434\u0430\u043D\u0435 \u043D\u0430 \u0440\u0430\u043D\u0434\u043E\u043C\u0438\u0437\u0438\u0440\u0430\u043D\u043E \u043D\u0430\u0431\u043E\u0440 \u043E\u0442 \u0447\u0438\u0441\u043B\u0430 . . .</b>
SORTING_WITH_HTML=<font face=\"arial,sans-serif\" size=\"2\"><b>\u0421\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435 \u0441 %s . . .</b>
SORTING_WITH=\u0421\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435 \u0441
SUCCESS=\u0423\u0441\u043F\u0435\u0445
FAILURE=\u041D\u0435\u0443\u0441\u043F\u0435\u0445
SORT_TEST_CREATION_FAILURE=\u0421\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435 \u043D\u0435\u0438\u0437\u043F\u044A\u043B\u043D\u0435\u043D\u0438\u0435 \u0422\u0435\u0441\u0442 \u0421\u044A\u0437\u0434\u0430\u0432\u0430\u043D\u0435
FAILED_TO_CREATE_ARRAY=<font face=\"arial,sans-serif\" size=\"2\">\u041D\u0435 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0441\u0435 \u0441\u044A\u0437\u0434\u0430\u0434\u0435 \u0442\u0435\u0441\u0442 \u043C\u0430\u0441\u0438\u0432.
SYNTAX_FOR_HEAP_SPACE=<font face=\"arial,sans-serif\" size=\"2\">\u0411\u0440\u043E\u044F\u0442 \u043D\u0430 \u0447\u0438\u0441\u043B\u0430\u0442\u0430 \u0435 \u0442\u0432\u044A\u0440\u0434\u0435 \u0433\u043E\u043B\u044F\u043C, \u0437\u0430 \u043F\u043E \u043F\u043E\u0434\u0440\u0430\u0437\u0431\u0438\u0440\u0430\u043D\u0435 <i>\u043A\u0443\u043F \u043F\u0440\u043E\u0441\u0442\u0440\u0430\u043D\u0441\u0442\u0432\u043E</i>, \u0434\u0430\u0434\u0435\u043D\u0430 \u043E\u0442 Java Virtual Machine (VM). \u041C\u043E\u0436\u0435\u0442\u0435 \u0434\u0430 \u0441\u0442\u0430\u0440\u0442\u0438\u0440\u0430\u0442\u0435 Java VM \u0441 \u0440\u0430\u0437\u0448\u0438\u0440\u0435\u043D\u0438 <i>\u043A\u0443\u043F \u043F\u0440\u043E\u0441\u0442\u0440\u0430\u043D\u0441\u0442\u0432\u043E</i>. \u0421\u043B\u0435\u0434\u043D\u0438\u0442\u0435 \u043A\u043E\u043C\u0430\u043D\u0434\u043D\u0438\u044F \u0440\u0435\u0434 \u0441\u0442\u0430\u0440\u0442\u0438\u0440\u0430 Java VM \u0441 <i>\u043A\u0443\u043F \u043F\u0440\u043E\u0441\u0442\u0440\u0430\u043D\u0441\u0442\u0432\u043E</i> \u043E\u0442 1 \u0433\u0438\u0433\u0430\u0431\u0430\u0439\u0442, \u0438 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0432\u0430 <i> SortTest </i> \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u0430.<br><br><b>\u00A0\u00A0\u00A0java -Xmx1000m -jar SortTest.jar
BEFORE_SORTING=<font face=\"arial,sans-serif\" size=\"2\"><b>\u041F\u0440\u0435\u0434\u0438 \u0441\u043E\u0440\u0442\u0438\u0440\u0430\u043D\u0435</b>
AFTER_SORTING_HTML=<br><br><b>%s: %s<br>\u0421\u043B\u0435\u0434 \u0442\u043E\u0432\u0430 \u0440\u0430\u0437\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u0435</b> <i>\u0418\u0437\u0442\u0435\u0447\u0435 \u0432\u0440\u0435\u043C\u0435\u0442\u043E</i>: <b>%.3f</b>%s
